# Christmas Sales and Trend Data Analysis.

### Import Libraries.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
plt.style.use('fivethirtyeight')
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
from copy import deepcopy

### Data Extraction.

In [2]:
#The dataset for christmas sales.
data = 'Christmas Sales and Trends.csv'

### Dataframe Creation.

In [3]:
df = pd.read_csv(data)

In [4]:
df

,TransactionID,Date,Time,CustomerID,Age,Gender,Location,StoreID,OnlineOrderFlag,ProductID,...,PaymentType,PromotionApplied,DiscountAmount,GiftWrap,ShippingMethod,DeliveryTime,Weather,Event,CustomerSatisfaction,ReturnFlag
0,1,12/24/2020,7:27:59,441,27,Other,City_15,NaN,True,106,...,Credit Card,False,0.000000,False,Standard,5.0,Snowy,NaN,5,False
1,2,11/18/2022,14:36:39,340,43,Male,City_13,NaN,True,816,...,Credit Card,True,0.000000,True,Express,3.0,Sunny,NaN,2,True
2,3,12/26/2019,20:23:50,31,25,Other,City_7,92.0,False,508,...,Credit Card,False,0.000000,False,NaN,NaN,Rainy,Christmas Market,4,False
3,4,11/13/2018,23:08:08,39,64,Male,City_20,100.0,False,710,...,Debit Card,False,0.000000,True,NaN,NaN,Rainy,NaN,1,True
4,5,12/13/2020,4:38:08,344,26,Other,City_10,90.0,False,687,...,Cash,False,0.000000,True,NaN,NaN,Sunny,Christmas Market,4,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,12/21/2022,12:05:06,245,25,Other,City_10,NaN,True,54,...,Credit Card,False,9.107212,True,Express,4.0,Sunny,Black Friday,4,False
9996,9997,11/24/2022,17:28:29,295,46,Female,City_17,NaN,True,324,...,Debit Card,True,4.153859,True,Express,5.0,Rainy,Black Friday,2,True
9997,9998,11/2/2021,23:20:58,202,46,Female,City_13,22.0,False,892,...,Cash,True,7.368328,True,NaN,NaN,Snowy,Black Friday,2,False
9998,9999,11/11/2020,11:33:17,310,64,Other,City_8,NaN,True,237,...,Online Payment,True,0.000000,True,Express,1.0,Sunny,Christmas Market,1,False
9999,10000,11/16/2022,17:01:01,469,39,Female,City_15,NaN,True,490,...,Cash,True,0.000000,True,Overnight,2.0,Snowy,Christmas Market,2,True

### Data Cleaning.

In [5]:
#Checking the data types.
df.dtypes

TransactionID             int64
Date                     object
Time                     object
CustomerID                int64
Age                       int64
Gender                   object
Location                 object
StoreID                 float64
OnlineOrderFlag            bool
ProductID                 int64
ProductName              object
Category                 object
Quantity                  int64
UnitPrice               float64
TotalPrice              float64
PaymentType              object
PromotionApplied           bool
DiscountAmount          float64
GiftWrap                   bool
ShippingMethod           object
DeliveryTime            float64
Weather                  object
Event                    object
CustomerSatisfaction      int64
ReturnFlag                 bool
dtype: object

In [6]:
#Removing commas in the numerical data.
df = df.replace(',','',regex = True)

In [7]:
df.isnull().sum()

TransactionID              0
Date                       0
Time                       0
CustomerID                 0
Age                        0
Gender                     0
Location                   0
StoreID                 5418
OnlineOrderFlag            0
ProductID                  0
ProductName                0
Category                   0
Quantity                   0
UnitPrice                  0
TotalPrice                 0
PaymentType                0
PromotionApplied           0
DiscountAmount             0
GiftWrap                   0
ShippingMethod          4582
DeliveryTime            4582
Weather                    0
Event                   2838
CustomerSatisfaction       0
ReturnFlag                 0
dtype: int64

In [8]:
df.drop('StoreID',axis = 1, inplace = True)
df.drop('ShippingMethod',axis = 1, inplace = True)
df.drop('DeliveryTime',axis = 1, inplace = True)
df.drop('Event',axis = 1, inplace = True)

In [9]:
df.isnull().sum()

TransactionID           0
Date                    0
Time                    0
CustomerID              0
Age                     0
Gender                  0
Location                0
OnlineOrderFlag         0
ProductID               0
ProductName             0
Category                0
Quantity                0
UnitPrice               0
TotalPrice              0
PaymentType             0
PromotionApplied        0
DiscountAmount          0
GiftWrap                0
Weather                 0
CustomerSatisfaction    0
ReturnFlag              0
dtype: int64

In [10]:
df

,TransactionID,Date,Time,CustomerID,Age,Gender,Location,OnlineOrderFlag,ProductID,ProductName,...,Quantity,UnitPrice,TotalPrice,PaymentType,PromotionApplied,DiscountAmount,GiftWrap,Weather,CustomerSatisfaction,ReturnFlag
0,1,12/24/2020,7:27:59,441,27,Other,City_15,True,106,Toys_Product,...,5,96.786255,483.931273,Credit Card,False,0.000000,False,Snowy,5,False
1,2,11/18/2022,14:36:39,340,43,Male,City_13,True,816,Clothing_Product,...,1,95.279579,95.279579,Credit Card,True,0.000000,True,Sunny,2,True
2,3,12/26/2019,20:23:50,31,25,Other,City_7,False,508,Clothing_Product,...,2,52.371645,104.743291,Credit Card,False,0.000000,False,Rainy,4,False
3,4,11/13/2018,23:08:08,39,64,Male,City_20,False,710,Toys_Product,...,5,63.647293,318.236463,Debit Card,False,0.000000,True,Rainy,1,True
4,5,12/13/2020,4:38:08,344,26,Other,City_10,False,687,Toys_Product,...,3,57.384041,172.152122,Cash,False,0.000000,True,Sunny,4,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,12/21/2022,12:05:06,245,25,Other,City_10,True,54,Decorations_Product,...,1,91.072121,91.072121,Credit Card,False,9.107212,True,Sunny,4,False
9996,9997,11/24/2022,17:28:29,295,46,Female,City_17,True,324,Electronics_Product,...,1,41.538590,41.538590,Debit Card,True,4.153859,True,Rainy,2,True
9997,9998,11/2/2021,23:20:58,202,46,Female,City_13,False,892,Food_Product,...,3,24.561093,73.683280,Cash,True,7.368328,True,Snowy,2,False
9998,9999,11/11/2020,11:33:17,310,64,Other,City_8,True,237,Electronics_Product,...,3,20.334764,61.004291,Online Payment,True,0.000000,True,Sunny,1,False
9999,10000,11/16/2022,17:01:01,469,39,Female,City_15,True,490,Electronics_Product,...,4,82.007183,328.028730,Cash,True,0.000000,True,Snowy,2,True

### Exploratory Data Analysis

* ##### Descriptive Analysis

In [12]:
df['Age'].describe()

count    10000.000000
mean        43.791700
std         15.366585
min         18.000000
25%         30.000000
50%         44.000000
75%         57.000000
max         70.000000
Name: Age, dtype: float64

In [13]:
df['Gender'].describe()

count     10000
unique        3
top        Male
freq       3385
Name: Gender, dtype: object

In [14]:
df['ProductID'].describe()

count    10000.000000
mean       500.234800
std        288.741317
min          1.000000
25%        252.000000
50%        500.000000
75%        750.000000
max       1000.000000
Name: ProductID, dtype: float64

In [15]:
df['Location'].describe()

count       10000
unique         20
top       City_13
freq          550
Name: Location, dtype: object

In [16]:
df['PaymentType'].describe()

count     10000
unique        4
top        Cash
freq       2540
Name: PaymentType, dtype: object

In [17]:
df['Weather'].describe()

count     10000
unique        3
top       Rainy
freq       3408
Name: Weather, dtype: object

* ### Using SqL for proper EDA.

In [18]:
! pip install -U pandasql

Requirement already satisfied: pandasql in c:\users\hp\anaconda3\lib\site-packages (0.7.3)
Requirement already satisfied: numpy in c:\users\hp\anaconda3\lib\site-packages (from pandasql) (1.24.3)
Requirement already satisfied: pandas in c:\users\hp\anaconda3\lib\site-packages (from pandasql) (2.0.3)
Requirement already satisfied: sqlalchemy in c:\users\hp\anaconda3\lib\site-packages (from pandasql) (1.4.39)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\anaconda3\lib\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\anaconda3\lib\site-packages (from pandas->pandasql) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\hp\anaconda3\lib\site-packages (from pandas->pandasql) (2023.3)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\hp\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (2.0.1)
Requirement already satisfied: six>=1.5 in c:\users\hp\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas->pandasql) (1.16.0)

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x00000247854DE090>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/pandasql/
WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x00000247854ED210>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/pandasql/
WARNING: Retrying (Retry(total=2, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x00000247854FA0D0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/pandasql/
WARNING: Retrying (Retry(total=1, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x00000247854F8710>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/pandasql/
WARNING: Retrying (Retry(total=0, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x0000024785508410>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/pandasql/

In [19]:
#Using SQL to wrangle data.
from pandasql import sqldf

* #### Sales trend over time.

In [26]:
#The days with most sales.
c = """
    SELECT Date,MAX(TotalPrice)
    FROM df
    GROUP BY TotalPrice
    ORDER BY TotalPrice DESC
    LIMIT 5;
    """

In [27]:
print(sqldf(c,locals()))

         Date  MAX(TotalPrice)
0  11/30/2019       499.982894
1   12/3/2020       499.870883
2   12/2/2022       499.458664
3   12/1/2021       499.117298
4  12/20/2018       499.112901

In [31]:
#The days with the least sales.
d = """
    SELECT Date,MIN(TotalPrice)
    FROM df
    GROUP BY TotalPrice
    ORDER BY TotalPrice ASC
    LIMIT 5;
    """

In [32]:
print(sqldf(d,locals()))

         Date  MIN(TotalPrice)
0  11/28/2018        10.017153
1  11/18/2022        10.021784
2  12/11/2022        10.114081
3  11/10/2021        10.270027
4  11/26/2021        10.274273

* #### Customer Demographics/Analysis.

In [123]:
#Customers ith most price of total goods bought and their prices.
b = """
    SELECT CustomerID,MAX(TotalPrice)
    FROM df
    GROUP BY TotalPrice
    ORDER BY TotalPrice DESC
    LIMIT 5;
    """

print(sqldf(b,locals()))

   CustomerID  MAX(TotalPrice)
0         343       499.982894
1         115       499.870883
2         184       499.458664
3          51       499.117298
4          17       499.112901

In [35]:
#Customer Age distribution.
df['Age'].nunique()

53

In [53]:
df['Age'].count()

10000

In [63]:
#The total age distribution.
e = """
    SELECT COUNT(Age),Age
    FROM df
    ORDER BY Age
    """

In [64]:
print(sqldf(e,locals()))

    COUNT(Age)  Age
0          215   18
1          172   19
2          202   20
3          225   21
4          210   22
5          188   23
6          161   24
7          200   25
8          185   26
9          175   27
10         185   28
11         197   29
12         197   30
13         195   31
14         188   32
15         192   33
16         206   34
17         170   35
18         192   36
19         175   37
20         213   38
21         172   39
22         166   40
23         188   41
24         189   42
25         154   43
26         212   44
27         209   45
28         197   46
29         164   47
30         170   48
31         208   49
32         190   50
33         190   51
34         189   52
35         166   53
36         184   54
37         191   55
38         177   56
39         221   57
40         195   58
41         197   59
42         177   60
43         181   61
44         200   62
45         185   63
46         179   64
47         182   65
48         180   66
49         171   67
50         191   68
51         201   69
52         181   70

In [65]:
##The age distribution with  most sales.
f = """
    SELECT COUNT(Age) as COUNT,Age
    FROM df
    GROUP BY Age
    ORDER BY COUNT DESC
    LIMIT 5
    """

In [66]:
print(sqldf(f,locals()))

   COUNT  Age
0    225   21
1    221   57
2    215   18
3    213   38
4    212   44

In [67]:
#The age distribution with the least shopping.
g = """
    SELECT COUNT(Age) as COUNT,Age
    FROM df
    GROUP BY Age
    ORDER BY COUNT ASC
    LIMIT 5
    """

In [69]:
print(sqldf(g,locals()))

   COUNT  Age
0    154   43
1    161   24
2    164   47
3    166   40
4    166   53

In [108]:
##The gender distribution in the christmas sales.
h = """
    SELECT COUNT(Gender) as COUNT,Gender
    FROM df
    GROUP BY Gender
    ORDER BY COUNT DESC
    """

In [109]:
print(sqldf(h,locals()))

   COUNT  Gender
0   3385    Male
1   3317   Other
2   3298  Female

* #### Online Sales

In [88]:
#The trend of orders online in the christmas sales
df['OnlineOrderFlag'].describe()

count     10000
unique        2
top        True
freq       5418
Name: OnlineOrderFlag, dtype: object

In [124]:
a = """
    SELECT OnlineOrderFlag,SUM(TotalPrice) AS TotalPrice
    FROM df
    GROUP BY OnlineOrderFlag
    ORDER BY TotalPrice DESC
    """

print(sqldf(a,locals()))

   OnlineOrderFlag     TotalPrice
0                1  900856.588123
1                0  753403.560117

* #### Product Analysis

In [96]:
##The product with the most sales entry and represented by productID.
k = """
    SELECT COUNT(ProductID) as COUNT,ProductID
    FROM df
    GROUP BY ProductID
    ORDER BY COUNT DESC
    Limit 5
    """

In [97]:
print(sqldf(k,locals()))

   COUNT  ProductID
0     21        994
1     20        914
2     20        711
3     20        527
4     19        911

In [100]:
##The unit products withthe highest unit prices
m = """
    SELECT ProductID,ProductName,Category,UnitPrice
    FROM df
    GROUP BY ProductID
    ORDER BY UnitPrice DESC
    Limit 5
    """

In [101]:
print(sqldf(m,locals()))

   ProductID          ProductName     Category  UnitPrice
0        478         Food_Product         Food  99.922524
1        525  Electronics_Product  Electronics  99.894685
2        285         Food_Product         Food  99.843086
3        333         Food_Product         Food  99.822580
4        650  Electronics_Product  Electronics  99.696731

In [102]:
##The unit product with the least price
n = """
    SELECT ProductID,ProductName,Category,UnitPrice
    FROM df
    GROUP BY ProductID
    ORDER BY UnitPrice ASC
    Limit 5
    """

In [103]:
print(sqldf(n,locals()))

   ProductID          ProductName     Category  UnitPrice
0        591     Clothing_Product     Clothing  10.069368
1        782     Clothing_Product     Clothing  10.446036
2        395         Food_Product         Food  10.492663
3        947  Electronics_Product  Electronics  10.494167
4        507  Electronics_Product  Electronics  10.609897

In [106]:
##The most purchased products in ranking.
o = """
    SELECT COUNT(Category) AS Count,Category
    FROM df
    GROUP BY Category
    order by count desc
    
    """

In [107]:
print(sqldf(o,locals()))

   Count     Category
0   2053  Electronics
1   2011         Toys
2   1995  Decorations
3   1991         Food
4   1950     Clothing

* #### Geographical Analysis.

In [110]:
##The location with the highest sales entry
p = """
    SELECT COUNT(Location) AS Count,Location
    FROM df
    GROUP BY Location
    order by Count desc
    LIMIT 5
    """

In [112]:
print(sqldf(p,locals()))

   Count Location
0    550  City_13
1    517  City_12
2    516  City_18
3    516   City_1
4    515  City_14

In [115]:
##The top 5 locations with the highest total sales
q = """
    SELECT Location,SUM(TotalPrice) as TotalSales
    FROM df
    GROUP BY Location
    order by TotalSales desc
    LIMIT 5
    """

print(sqldf(q,locals()))

  Location    TotalSales
0  City_13  90894.610846
1   City_1  87664.023976
2  City_15  87294.380507
3   City_2  86683.215730
4  City_19  86531.005837

In [116]:
##The top 5 locations with the least total sales
r = """
    SELECT Location,SUM(TotalPrice) as TotalSales
    FROM df
    GROUP BY Location
    order by TotalSales asc
    LIMIT 5
    """

print(sqldf(r,locals()))

  Location    TotalSales
0  City_10  73328.009559
1  City_17  74580.240657
2  City_16  76914.064461
3   City_5  77572.800467
4   City_7  78039.143892

* #### Payment Types

In [118]:
##The various payment method and the number of times used.
s = """
    SELECT PaymentType,Count(PaymentType) as Count
    FROM df
    GROUP BY PaymentType
    ORDER BY Count DESC
    """

print(sqldf(s,locals()))

      PaymentType  Count
0            Cash   2540
1  Online Payment   2536
2     Credit Card   2497
3      Debit Card   2427

In [122]:
##The payment types and which mode was used for most sales.
t = """
    SELECT PaymentType,SUM(TotalPrice) AS TotalPrice
    FROM df
    GROUP BY PaymentType
    ORDER BY TotalPrice DESC
    """

print(sqldf(t,locals()))

      PaymentType     TotalPrice
0            Cash  421579.300188
1     Credit Card  421512.175000
2  Online Payment  408984.335652
3      Debit Card  402184.337400

* #### Weather and Sales.

In [121]:
##The various weather condition in the sales data and their count.
u = """
    SELECT Weather,Count(Weather) as Count
    FROM df
    GROUP BY Weather
    ORDER BY Count DESC
    """

print(sqldf(u,locals()))

  Weather  Count
0   Rainy   3408
1   Snowy   3324
2   Sunny   3268

In [125]:
## The weather condition and the total sales made.
v = """
    SELECT Weather,SUM(TotalPrice) AS TotalPrice
    FROM df
    GROUP BY Weather
    ORDER BY TotalPrice DESC
    """

print(sqldf(v,locals()))

  Weather     TotalPrice
0   Rainy  576425.456736
1   Snowy  542047.352662
2   Sunny  535787.338842

In [128]:
### The total sales made in the weather condition based on online orders
w = """
    SELECT Weather,SUM(TotalPrice) AS TotalPrice
    FROM df
    WHERE OnlineOrderFlag = True
    GROUP BY Weather
    ORDER BY TotalPrice DESC
    """

print(sqldf(w,locals()))

  Weather     TotalPrice
0   Rainy  310917.166089
1   Snowy  296757.336096
2   Sunny  293182.085938

In [127]:
### The total sales made in the weather condition based on physical orders.
x = """
    SELECT Weather,SUM(TotalPrice) AS TotalPrice
    FROM df
    WHERE OnlineOrderFlag = False
    GROUP BY Weather
    ORDER BY TotalPrice DESC
    """

print(sqldf(x,locals()))

  Weather     TotalPrice
0   Rainy  265508.290647
1   Snowy  245290.016566
2   Sunny  242605.252904

* #### Customer Satisfaction and Returns Analysis.

In [129]:
### The customer satisfaction ratings and their counts. 
y = """
    SELECT CustomerSatisfaction,Count(CustomerSatisfaction) as Count
    FROM df
    GROUP BY CustomerSatisfaction
    ORDER BY Count DESC
    """

print(sqldf(y,locals()))

   CustomerSatisfaction  Count
0                     1   2070
1                     4   1991
2                     3   1991
3                     5   1974
4                     2   1974

In [130]:
### The customer satisfaction rating and count when a product is returned.
z = """
    SELECT CustomerSatisfaction,Count(CustomerSatisfaction) as Count
    FROM df
    WHERE ReturnFlag = True
    GROUP BY CustomerSatisfaction
    ORDER BY Count DESC
    """

print(sqldf(z,locals()))

   CustomerSatisfaction  Count
0                     3   1057
1                     1   1053
2                     2    991
3                     4    986
4                     5    967

In [131]:
### The customer satisfaction rating and count when a product is not returned.
a1 = """
    SELECT CustomerSatisfaction,Count(CustomerSatisfaction) as Count
    FROM df
    WHERE ReturnFlag = False
    GROUP BY CustomerSatisfaction
    ORDER BY Count DESC
    """

print(sqldf(a1,locals()))

   CustomerSatisfaction  Count
0                     1   1017
1                     5   1007
2                     4   1005
3                     2    983
4                     3    934

In [132]:
###The products that has been returned the most in the sales data
a2 = """
    SELECT ProductName,Count(ProductName) as Count
    FROM df
    WHERE ReturnFlag = True
    GROUP BY ProductName
    ORDER BY Count DESC
    """

print(sqldf(a2,locals()))

           ProductName  Count
0  Electronics_Product   1062
1         Toys_Product   1025
2  Decorations_Product   1014
3         Food_Product   1008
4     Clothing_Product    945

In [134]:
###The location with the most number of products returned.
a3 = """
    SELECT Location,Count(Location) as Count
    FROM df
    WHERE ReturnFlag = True
    GROUP BY Location
    ORDER BY Count DESC
    LIMIT 3
    """

print(sqldf(a3,locals()))

  Location  Count
0  City_13    289
1  City_12    276
2   City_3    274

* #### Gift Wrapping Service Analysis.

In [136]:
## Gift Wraps and their count.
b1 = """
    SELECT GiftWrap,Count(GiftWrap) as Count
    FROM df
    GROUP BY GiftWrap
    ORDER BY Count DESC
    """

print(sqldf(b1,locals()))

   GiftWrap  Count
0         1   5025
1         0   4975

In [137]:
##The product and their counts on number of times wrapped.
b2 = """
    SELECT ProductName,Count(ProductName) as Count
    FROM df
    WHERE GiftWrap = True
    GROUP BY ProductName
    ORDER BY Count DESC
    """

print(sqldf(b2,locals()))

           ProductName  Count
0  Electronics_Product   1032
1         Toys_Product   1028
2  Decorations_Product   1025
3         Food_Product    976
4     Clothing_Product    964

### Visualizations would be presented in Microsoft PowerBI.